Revit 2027 API
BuiltInFailures.RoomFailures.AreaUnplaceWarning Property
 An Area was deleted from all model views but still remains in this project. \n The area can be removed from any schedule or placed back in the model using the Area command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaUnplaceWarning { get; }
Public Shared ReadOnly Property AreaUnplaceWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaUnplaceWarning {
	FailureDefinitionId^ get ();
}
static member AreaUnplaceWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace